src/main/custom_tsung/game_launch/tsung_game_launch.xml
<?xml version="1.0" encoding="UTF-8" ?>
<!DOCTYPE tsung SYSTEM "??/tsung-1.3.3/tsung-1.0.dtd">


<!-- dumptraffic : true, light or false -->
<!-- log levels : emergency, critical, error, warning,notice, info, debug -->
<tsung loglevel="warning" version="1.0" dumptraffic="light">

     <!-- Client side setup -->
     <clients>
          <client host="localhost" use_controller_vm="true"/>
     </clients>

     <!-- TODO: distribute the injection load onto several tsung injectors -->
<!--      <clients>
          <client host="injector" weight="1" maxusers="800">
               <ip value="10.9.195.12"></ip>
               <ip value="10.9.195.13"></ip>
          </client>
          <client host="memphis" weight="3" maxusers="600" cpu="2"/>
     </clients>
 -->

     <!-- Server side setup -->
     <servers>
          <server host="localhost" port="9090" type="tcp"/>
     </servers>

     <!-- TODO: review how that f*****g monitoring works -->
     <!-- to start os monitoring (cpu, network, memory). Use an erlang
     agent on the remote machine or SNMP. erlang is the default -->
     <!-- <monitoring> -->
          <!-- <monitor host="192.168.1.1" type="erlang"/> -->
          <!-- <monitor host="192.168.1.201" type="erlang"/> -->
     <!-- </monitoring> -->
  
     <load>
          <!-- several arrival phases can be set: for each phase, you can set
          the mean inter-arrival time between new clients and the phase
          duration -->
          <arrivalphase phase="1" duration="1" unit="second">
               <users arrivalrate="1" unit="second"/>
          </arrivalphase>


          <!-- a single Game session injection -->
         <!--  <user session="user_creation" start_time="1" unit="second"/> -->
          
<!--           <arrivalphase phase="2" duration="2" unit="minute">
               <users interarrival="1" unit="second"/>
          </arrivalphase>
 -->
     </load>



     <options>
         <option type="ts_http" name="user_agent" />                 
         <option name="file_server" id="game_content" value="game"/>          
         <option name="file_server" id="key" value="authentication_key"/>  
     </options>

     <!-- start a session for a http user. the probability is the
     frequency of this type os session. The sum of all session's
     probabilities must be 100 -->

     <sessions>
        <session name="launch_game" probability="100" type="ts_http">	
                 	
			<setdynvars sourcetype="file" fileid="game_content" delimiter="%%" order="iter">
				 <var name="content" />
			</setdynvars>
	       
			<setdynvars sourcetype="file" fileid="key" delimiter="%%" order="iter">
				 <var name="key" />
			</setdynvars>
			
			<request subst="true">
			
				<match do="log" when="match">HTTP/1.1 201 Created</match>
				<match do="log" when="nomatch">HTTP/1.1 201 Created</match>
				<http url="/api/game" method="POST" version="1.1" contents='{&quot;authentication_key&quot;:&quot;%%_key%%&quot;,&quot;parameters&quot;:&quot;%%_content%%&quot;}' >
					<http_header name="Content-type" value="application/json"/>
				</http>
			</request>

		</session>
     </sessions>
</tsung>